In [1]:
import pandas as pd

raw = [
    {"date": "2026-01-01", "menu": "Americano", "price": "4500원", "qty": "2", "paid": "TRUE"},
    {"date": "2026/01/01", "menu": "Latte",     "price": "5,000",  "qty": 1,   "paid": "True"},
    {"date": "2026-01-02", "menu": "Latte",     "price": None,     "qty": 2,   "paid": "FALSE"},
    {"date": "2026-01-03", "menu": "Mocha",     "price": "5500",   "qty": None,"paid": True},
    {"date": "2026-01-03", "menu": "Americano", "price": "4500",   "qty": 1,   "paid": "TRUE"},
    {"date": "2026-01-04", "menu": "Latte",     "price": "5000원", "qty": "3", "paid": "TRUE"},
    {"date": "2026-01-05", "menu": "Tea",       "price": "4000",   "qty": "1", "paid": "TRUE"},
]

df = pd.DataFrame(raw)
df

         date       menu  price   qty   paid
0  2026-01-01  Americano  4500원     2   TRUE
1  2026/01/01      Latte  5,000     1   True
2  2026-01-02      Latte   None     2  FALSE
3  2026-01-03      Mocha   5500  None   True
4  2026-01-03  Americano   4500     1   TRUE
5  2026-01-04      Latte  5000원     3   TRUE
6  2026-01-05        Tea   4000     1   TRUE

In [2]:
import pandas as pd
pd.__version__

'2.3.3'

In [3]:
s = pd.Series([10, 20, 30], name="score")
s

0    10
1    20
2    30
Name: score, dtype: int64

In [5]:
df.head(3)

         date       menu  price qty   paid
0  2026-01-01  Americano  4500원   2   TRUE
1  2026/01/01      Latte  5,000   1   True
2  2026-01-02      Latte   None   2  FALSE

In [6]:
df.shape

(7, 5)

In [7]:
df.columns

Index(['date', 'menu', 'price', 'qty', 'paid'], dtype='object')

In [8]:
df.dtypes

date     object
menu     object
price    object
qty      object
paid     object
dtype: object

In [10]:
df.isna().sum()

date     0
menu     0
price    1
qty      1
paid     0
dtype: int64

In [11]:
df["date"] = pd.to_datetime(df["date"], errors="coerce")
df["date"]

0   2026-01-01
1          NaT
2   2026-01-02
3   2026-01-03
4   2026-01-03
5   2026-01-04
6   2026-01-05
Name: date, dtype: datetime64[ns]

In [14]:
df["price"] = (
    df["price"]
    .astype("string")
    .str.replace("원", "", regex=False)
    .str.replace(",", "", regex=False)
)

df["price"] = pd.to_numeric(df["price"], errors="coerce")
df["price"]

0    4500
1    5000
2    <NA>
3    5500
4    4500
5    5000
6    4000
Name: price, dtype: Int64